{  
  "title": "06. The clash of everything, everywhere",
  "music": "chapter1.mp3",
  "volume": 0.4,
  "slides": [
    {
      "type": "dream",
      "text": "# 06. The clash of everything, everywhere \n\n  If Karl Marx viewed the progression of society as the progression through historical materialism... \n\n Then I would say that history progresses through the fundamental and irreconcilable conflict between the morality of consequences vs the morality of rights. \n\n **all conflicts of political or ethical nature are conflicts between utilitarianism and deontology**. \n\n *This is the central finding of this exegesis.*",
      "soundEffect" : "test.mp3",
      "noHistory" : false,
      "fadeInTime" : 1800,
      "fadeOutTime" : 2000,
      "blackText": true
    }, {
      "type": "info",
      "text": "This conflict goes by many names, I'm sure you've heard some of them: \n\n - The political Left vs the political Right \n\n - Socialism vs Capitalism \n\n - Objective value (Labour Theory of Value) vs Subjective value (Market price) \n\n - Collectivism vs Individualism \n\n - Living by the permission of others vs the inherent right to live \n\n - Identity politics vs Egalitarianism \n\n - Rehabilitative justice vs Retributive justice \n\n - Affirmative action (demonstrating oppression) vs Strict meritocracy (demonstrating merit) \n\n - Redistribution vs Wealth creation \n\n - Femininity vs Masculinity (gender wars) \n\n ... \n\n The list goes on.",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "reference":"",
      "transition": "fade_long"
    }, {
      "type": "info",
      "text": "If we drill down to any of these topics to the most fundamental level, it always boils down to utilitarianism vs deontology. This is the fundamental political conflict of our present day, and between them there can be no compromise. \n\n I will give one example of the conflict, the rest are self evident. \n\n (If I have time I might return to add more examples...)",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "reference":"",
      "transition": "fade_long"
    }, {
      "type": "info",
      "text": "#### Socialism vs Capitalism \n\n Some would say that the conflict between socialism and capitalism is ideological. \n\n I say it is the prime example of the conflict between utilitarianism and deontology. It is this fundamentally irreconcilable difference in moral methodology that is the political division we see today. \n\n Because Socialism is really a manifestation of utilitarianism applied to socioeconomic systems. It is the maxim of *the greatest good for the greatest number* that justifies ruthless revolutions and destruction of private property, in hope for a fairer future not for the elite ruling class, but for everyone. \n\n Socialism without utilitarianism is shallow, lacking a clear ethical imperative that justifies its sacrifices of personal liberty and property rights (which, by the way, is a fundamental human rights as defined by the UN Declaration of Human Rights). Without utilitarianism, socialism devolves into mere collectivism, and collectivism has already been tried with failure as the only result. \n\n Without a philosophical imperative, socialists appeal to the emotions of the masses, hoping to gain their empathy and pity through the display of weakness and oppression, often seen by the political right as \"weak makes right\", and losing its intellectual rigour and instead sidesteps the rational justifications for redistribution devolves into the appeal to cheap sentimentality. In practice, without the foundations of utilitarian ethics, this is unfortunately what many socialists defaults to do in attempts to persuade their political dissidents. ",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "reference":"Article 17, Universal Declaration of Human Rights. (1948). \"Everyone has the right to own property alone as well as in association with others. No one shall be arbitrarily deprived of his property.\"",
      "transition": "fade_long"
    }, {
      "type": "info",
      "text": "#### Socialism vs Capitalism \n\n Similarly, Capitalism without deontology is weak and unjustifiable. stripped of its core defense of inalienable rights that justifies individual liberty and freedom from coercion, it must continually give way to the encroachment of its rights to collectivism for the sake of \"the greater good\". \n\n Without deontological principles, there is no justification to allow unfettered freedom and have the strong trample over the weak in the ruthless competition of free markets. There is no justification to allow inequality in a society without deontological imperatives. Even individual rights cannot rationally justify the gross inequality we witness in some parts of the world today. After all why not give billionaires a certificate to say \"Congratulations you've won the game of capitalism\" and sack their wealth to feed the poor children in Africa? \n\n Capitalism would lose its moral armour, leaving it vulnerable to relentless advances of coercive power from the political, government, and social institutions. In front of the appeal to both emotions and morality, and in the absence of deontology, capitalism stands no chance. \n\n Some advocates of capitalism have attempted to adopt a consequentialist defence – the most notable being Milton Friedman, the Nobel Laureate who was a central figure in Chicago school of economics. But, the empirical sciences (of which Economics is one) can only tell you how to get what you want; it does not tell you what to want, for that is a value judgement at the height of which sits moral philosophy. The Chicago School of thought, or \"Consequentialist Libertarianism\" often fails at the teleological level. The easiest way to see this is if a socialist claim \"we don't want economic growth, we want equality.\" And the Chicago school will have no answer to it except also resorting to similar kinds of political rhetoric. \n\n The reality is that in the socialism vs capitalism clash, neither side could claim itself to be the moral one. It should be clear by now, after the Trump victory in November 2024, that this clash will continue indefinitely into the future.",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "reference":"",
      "transition": "fade_long"
    },{
      "type": "info",
      "text": "#### Abortion \n\n Some ideologies have no clear utilitarian or deontological motive, because either they are not well defined, or that they aren't political. \n\n I will now attempt to address some of the hardest ethical dilemmas. After all if we can resolve these, then the lesser polarising ones including the everyday bickering of the film industry will be trivial. \n\n Let's start with a hard one: The Abortion issue. \n\n - Utilitarianism: Pro Life. The woman's suffering of 10 months is inconsequential to a life. Therefore, abortion should not be allowed. The causes of pregnancy are inconsequential, as they do not affect the outcome. \n\n - Deontology: Pro Choice. Some might argue that the foetus has inalienable right too. But, since a foetus cannot rationally think, it does not possess pure reason. Therefore categorical imperatives does not apply to the foetus – only the mother.  ",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "reference":"",
      "transition": "fade_long"
    }, {
      "type": "info",
      "text": "#### Criminal Justice \n\n Another hard one (not really): Rehabilitative therapy or death penalty for convicted premeditated murderers. \n\n On the idea of punishing crime, (perhaps unsurprisingly) Bentham has this to say...",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "reference":"",
      "transition": "fade_long"
    }, {
      "type": "quote",
      "text": "All punishment is mischief: all punishment in itself is evil.",
      "characterImage": "bentham.jpg",
      "quoteWho" : "Jeremy Bentham",
      "soundEffect": "test.mp3",
      "reflectionText": "... which speaks enough about the utilitarian position in policies relating to criminal justice.",
      "reference":"Bentham, J. (1789). *An Introduction to the Principles of Morals and Legislation*. Clarendon Press.",
      "background": "philosophy_classroom.jpg",
      "guess": false
    }, {
      "type": "info",
      "text": "#### Postmodernism \n\n It may be tempting to think that moral relativism is a form of postmodernism. But it would be a stretch to make that connection. \n\n In short, postmodernism is not a call to political action, and thus it is morally neutral. Instead, postmodernism provides a set of tools for deconstruction and analysis... And Pluralism is a method, rather than a moral imperative. \n\n In other words, postmodernism is analytical and non-prescriptive. Or, at least, the early work of the postmodernist thinkers anyway. \n\n But what actions one might choose take based on the analytical insights derived from postmodernism, is inherently *utilitarian*. \n\n Kimberlé Crenshaw, for instance, departed from the earlier works of Bourdieu and Foucault, and did a lot of activism in her career focusing on the intersectional oppression that women of colour experience in a patriarchal society. \n\n Therefore I would argue, that as soon as postmodernists advance into the application level of their theories, they become utilitarian. \n\n A full argument is beyond this current exegesis. But, the easiest way to test this is to consider a hypothetical scenario, where the prominent figures of postmodernism, say Pierre Bourdeau, advocate for capitalism and free markets? Why not? – Probably because that is not the result he would want to see. Hence utilitarianism.",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "reference":"",
      "transition": "fade_long"
    }, {
      "type": "info",
      "text": "#### Conservatism \n\n \"But Mike, I'm neither a socialist nor a capitalist. I'm a conservative.\" One might object. \n\n Indeed, thinkers like von Mises held that conservatism is neither socialist nor libertarian. But, in my experience, conservatives are simply those who have not yet completely made up their mind about the utilitarianism vs deontology question. Once they do, they will almost inevitably shift toward one of the two ends of the conflict. \n\n ",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "transition": "fade_long"
    },{
      "type": "info",
      "text": "#### Aliens on Mars \n\n And just to stretch these theories one last time... \n\n Suppose that we find aliens on Mars (extraterrestrials, not illegal migrants, mind you...) and we discover that instead of being more advanced than us, they are more backwards than us, akin to the state of human civilisation during the early Mesopotamian ages, some 10000 years ago. \n\n Are we morally obligated sacrifice the resources on Earth to help these aliens on Mars? How would one even approach this question? \n\n Utilitarians would say it depends on how hard it is to transport resources to Mars. But certainly, we should try, if we have the capacity. \n\n Deontologists would say, that it will depend on whether these aliens are capable of *pure reason* like we do, the answer of which will determine whether categorical imperative will apply to these aliens the same way it applies to us; and subsequently make a moral determination on that basis. \n\n But this issue of Aliens is hardly political... \n\n (...when I have time I will return to the ideas of consent, and social contract theory...)",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "transition": "fade_long"
    }, {
      "type": "dream",
      "text": "By this point, I hope we can see just how profoundly the scope of this conflict in moral philosophies shapes the undercurrents of our day to day conflicts. \n\n Is there, then, any recourse for the utilitarians and the deontologists? \n\n Probably not. ",
      "soundEffect" : "test.mp3",
      "noHistory" : false,
      "fadeInTime" : 1800,
      "fadeOutTime" : 2000,
      "blackText": true
    }, {
      "type": "quote",
      "text": "Wait, can't one compromise and borrow different ideas from different philosophies according to the expediency of the moment?",
      "characterImage": "nixon.webp",
      "quoteWho" : "Richard Nixon",
      "soundEffect": "test.mp3",
      "reference":"Woods, R. B. (2005). The Limits of Expediency. *Cambridge University Press EBooks*, 320–350. https://doi.org/10.1017/cbo9780511814020.011",
      "background": "philosophy_classroom.jpg",
      "guess": false
    }, {
      "type": "info",
      "text": "Uhh, No.  \n\n As soon as you take one side, the other will deem you unethical. \n\n And if you try to act consistently with the ethics of both sides you will end up with none, because they are inherently contradictive to one another. \n\n So are we doomed then to repeat this eternal conflict ad infinitum? \n\n Oh, about that. Fear not, I have an idea that you might like... \n\n <p style=\"text-align: right\"> **End of chapter 06.** Click to continue to chapter 07...</p>",
      "soundEffect": "test.mp3",
      "background": "philosophy_classroom.jpg",
      "transition": "fade_long"
    }
  ]   
}